[
  {
    "title": "A communication network refers to the method that employees pass on informations",
    "img": "img/news/1.jpg",
    "category": "Communication Networks",
    "date": { "date": "01", "month": "Dec" },
    "details": [
      "A communication network refers to how information flows within the organization. Information within an organization generally flows through a system, rather than being a free flow.",
      "Communication networks are regular patterns of person-to-person relationships through which information flows in an organization. This means that the flow of information is managed, regulated. and structured. Communication networks may be formal or informal.",
      "This type of communication has both benefits and disadvantages. One of the biggest benefits is problem-solving. Once a subordinate has brought a problem to his superior’s notice, chances are that the problem will not recur, since the subordinate learns from his superior how to tackle it the next time."
    ]
  },
  {
    "title": "Distributed computing is a field of computer science that studies distributed systems",
    "img": "img/news/2.jpg",
    "category": "Networking and distributed computing",
    "date": { "date": "01", "month": "Dec" },
    "details": [
      "A distributed computer system consists of multiple software components that are on multiple computers, but run as a single system. The computers that are in a distributed system can be physically close together and connected by a local network, or they can be geographically distant and connected by a wide area network.",
      "Distributed computing systems can run on hardware that is provided by many vendors, and can use a variety of standards-based software components. Such systems are independent of the underlying software. They can run on various operating systems, and can use various communications protocols.",
      "A distributed system can consist of any number of possible configurations, such as mainframes, personal computers, workstations, minicomputers, and so on. The goal of distributed computing is to make such a network work as a single computer. Several machines can provide the same services, so if one is unavailable, work does not stop. Additionally, because many smaller machines can be used, this redundancy does not need to be prohibitively expensive."
    ]
  },
  {
    "title": " System software that manages computer hardware, software resources, and provides common services for computer programs",
    "img": "img/news/3.jpg",
    "category": "Operating Systems",
    "date": { "date": "01", "month": "Dec" },
    "details": [
      "An operating system is the program that, after being initially loaded into the computer by a boot program, manages all of the other application programs in a computer. The application programs make use of the operating system by making requests for services through a defined application program interface .",
      "In addition, users can interact directly with the operating system through a user interface, such as a command-line interface  or a graphical UI .",
      "An operating system brings powerful benefits to computer software and software development. Without an operating system, every application would need to include its own UI, as well as the comprehensive code needed to handle all low-level functionality of the underlying computer, such as disk storage, network interfaces and so on. Considering the vast array of underlying hardware available, this would vastly bloat the size of every application and make software development impractical."
    ]
  }
]
